In [23]:
import requests
import pandas as pd
from time import sleep
import numpy as np
import sys
sys.path.append("../")

import src.support as sp

from selenium import webdriver
from webdriver_manager.chrome import ChromeDriverManager
from selenium.webdriver.common.keys import Keys
from selenium.webdriver.chrome.options import Options

import warnings
warnings.filterwarnings('ignore')

In [24]:
opciones = Options()
opciones.add_experimental_option('excludeSwitches', ['enable-automation'])
opciones.add_experimental_option('useAutomationExtension', False)
opciones.add_argument('--start-maximized')
opciones.add_argument('user.data-dir=selenium') 
opciones.add_argument('--incognito')

In [19]:
df = pd.read_csv("../data/the_office_series.csv", index_col = 0)

In [20]:
df.head(1)

,Season,EpisodeTitle,About,Ratings,Votes,Viewership,Duration,Date,GuestStars,Director,Writers
0,1,Pilot,The premiere episode introduces the boss and s...,7.5,4936,11.2,23,24 March 2005,NaN,Ken Kwapis,Ricky Gervais |Stephen Merchant and Greg Daniels

In [21]:
len(df["EpisodeTitle"])

188

In [22]:
driver = webdriver.Chrome(ChromeDriverManager().install())
result_list = []

driver.get("https://www.imdb.com/title/tt0664521/")
sleep(3)
for i in range(len(df["EpisodeTitle"])):
    try:
        lista_principales = driver.find_element("css selector", "#__next > main > div > section.ipc-page-background.ipc-page-background--base.sc-9b716f3b-0.xBaTH > div > section > div > div.sc-4253d404-1.enxQRq.ipc-page-grid__item.ipc-page-grid__item--span-2 > section.ipc-page-section.ipc-page-section--base.sc-bfec09a1-0.gmonkL.title-cast.title-cast--episode.celwidget > div.ipc-shoveler.ipc-shoveler--base.ipc-shoveler--page0.title-cast__grid > div.ipc-sub-grid.ipc-sub-grid--page-span-2.ipc-sub-grid--wraps-at-above-l.ipc-shoveler__grid").text
        result_list.append(lista_principales)
        driver.find_element("css selector", "#iconContext-arrow-right").click()
    except:
        pass

In [25]:
len(result_list)

188

In [26]:
result_list[:3]

['Steve Carell\nMichael Scott\nRainn Wilson\nDwight Schrute\nJohn Krasinski\nJim Halpert\nJenna Fischer\nPam Beesly\nB.J. Novak\nRyan Howard\nMelora Hardin\nJan Levinson-Gould\nDavid Denman\nRoy Anderson\nLeslie David Baker\nStanley Hudson\nBrian Baumgartner\nKevin Malone\nAngela Kinsey\nAngela Martin\nHenriette Mantel\nOffice Worker\nMike McCaul\nOffice Worker\nOscar Nuñez\nOscar Martinez(as Oscar Nunez)\nPhyllis Smith\nPhyllis Lapin\nRandall Barnwell\nMadsen(uncredited)\nCreed Bratton\nCreed Bratton(uncredited)\nToby Huss\nTodd Packer(voice)(uncredited)',
 'Steve Carell\nMichael Scott\nRainn Wilson\nDwight Schrute\nJohn Krasinski\nJim Halpert\nJenna Fischer\nPam Beesly\nB.J. Novak\nRyan Howard\nLarry Wilmore\nMr. Brown\nLeslie David Baker\nStanley Hudson\nBrian Baumgartner\nKevin Malone\nKate Flannery\nMeredith Palmer\nMindy Kaling\nKelly Kapoor\nPaul Lieberstein\nToby Flenderson\nAngela Kinsey\nAngela Martin\nOscar Nuñez\nOscar Martinez(as Oscar Nunez)\nPhyllis Smith\nPhyllis Lapin\nCreed Bratton\nCreed Bratton(uncredited)',
 'Steve Carell\nMichael Scott\nRainn Wilson\nDwight Schrute\nJohn Krasinski\nJim Halpert\nJenna Fischer\nPam Beesly\nB.J. Novak\nRyan Howard\nMelora Hardin\nJan Levinson-Gould\nLeslie David Baker\nStanley Hudson\nBrian Baumgartner\nKevin Malone\nKate Flannery\nMeredith Palmer\nCharlie Hartsock\nTravel Agent\nMindy Kaling\nKelly Kapoor\nAngela Kinsey\nAngela Martin\nPaul Lieberstein\nToby Flenderson\nOscar Nuñez\nOscar Martinez(as Oscar Nunez)\nPhyllis Smith\nPhyllis Lapin\nCreed Bratton\nCreed Bratton(uncredited)…']

In [27]:
series = pd.Series(result_list)
series

0      Steve Carell\nMichael Scott\nRainn Wilson\nDwi...
1      Steve Carell\nMichael Scott\nRainn Wilson\nDwi...
2      Steve Carell\nMichael Scott\nRainn Wilson\nDwi...
3      Steve Carell\nMichael Scott\nRainn Wilson\nDwi...
4      Steve Carell\nMichael Scott\nRainn Wilson\nDwi...
                             ...
183    Rainn Wilson\nDwight Schrute\nJohn Krasinski\n...
184    Rainn Wilson\nDwight Schrute\nJohn Krasinski\n...
185    Rainn Wilson\nDwight Schrute\nJohn Krasinski\n...
186    Rainn Wilson\nDwight Schrute\nJohn Krasinski\n...
187    Rainn Wilson\nDwight Schrute\nJohn Krasinski\n...
Length: 188, dtype: object

In [28]:
df1 = series.to_frame()
df1 = df1.rename(columns = {0:'item'})

In [29]:
df1.head()

                                                item
0  Steve Carell\nMichael Scott\nRainn Wilson\nDwi...
1  Steve Carell\nMichael Scott\nRainn Wilson\nDwi...
2  Steve Carell\nMichael Scott\nRainn Wilson\nDwi...
3  Steve Carell\nMichael Scott\nRainn Wilson\nDwi...
4  Steve Carell\nMichael Scott\nRainn Wilson\nDwi...

In [30]:
df1['item'] = df1['item'].str.split('\n')

In [31]:
df1.head()

                                                item
0  [Steve Carell, Michael Scott, Rainn Wilson, Dw...
1  [Steve Carell, Michael Scott, Rainn Wilson, Dw...
2  [Steve Carell, Michael Scott, Rainn Wilson, Dw...
3  [Steve Carell, Michael Scott, Rainn Wilson, Dw...
4  [Steve Carell, Michael Scott, Rainn Wilson, Dw...

In [32]:
df1 = df1.drop([95, 108])

In [33]:
df1 = sp.reset_and_rename_index(df1, "episode_id")

In [34]:
df1.tail()

     episode_id                                               item
181         181  [Rainn Wilson, Dwight Schrute, John Krasinski,...
182         182  [Rainn Wilson, Dwight Schrute, John Krasinski,...
183         183  [Rainn Wilson, Dwight Schrute, John Krasinski,...
184         184  [Rainn Wilson, Dwight Schrute, John Krasinski,...
185         185  [Rainn Wilson, Dwight Schrute, John Krasinski,...

In [35]:
df1 = df1.explode('item')

In [36]:
df1.tail()

     episode_id                            item
185         185                     Ryan Howard
185         185                     Oscar Nuñez
185         185  Oscar Martinez(as Oscar Nunez)
185         185                  Craig Robinson
185         185                  Darryl Philbin

In [37]:
#para sacar el () de oscar
df1["item"] = df1["item"].str.replace(r"(\s*\(.*?\)\s*)", " ", regex=True)
df1.tail()

     episode_id             item
185         185      Ryan Howard
185         185      Oscar Nuñez
185         185  Oscar Martinez
185         185   Craig Robinson
185         185   Darryl Philbin

In [38]:
#para sacar el - de jan
df1["item"] = df1['item'].str.split('-').str[0]
df1.head(5)

   episode_id            item
0           0    Steve Carell
0           0   Michael Scott
0           0    Rainn Wilson
0           0  Dwight Schrute
0           0  John Krasinski

In [39]:
df1 = df1.rename(columns={"item": "complete_name"})
df1.head()

   episode_id   complete_name
0           0    Steve Carell
0           0   Michael Scott
0           0    Rainn Wilson
0           0  Dwight Schrute
0           0  John Krasinski

In [40]:
df1["complete_name"] = df1["complete_name"].str.strip()

In [41]:
df_api = pd.read_csv("../data/apiextraction.csv")
df_api.head()

  first_name last_name   complete_name
0    Michael     Scott   Michael Scott
1        Jim   Halpert     Jim Halpert
2     Dwight   Schrute  Dwight Schrute
3        Pam    Beesly      Pam Beesly
4       Ryan    Howard     Ryan Howard

In [42]:
left_merged = pd.merge(df1, df_api, how="left", on=["complete_name"])

In [43]:
left_merged = left_merged.dropna()

In [44]:
left_merged.tail()

      episode_id    complete_name first_name   last_name
6581         185      Erin Hannon       Erin      Hannon
6587         185  Toby Flenderson       Toby  Flenderson
6589         185      Ryan Howard       Ryan      Howard
6591         185   Oscar Martinez      Oscar    Martinez
6593         185   Darryl Philbin     Darryl     Philbin

In [45]:
#creed has the same name, drop creeds
left_merged = left_merged.drop_duplicates()
left_merged.head()

   episode_id   complete_name first_name last_name
1           0   Michael Scott    Michael     Scott
3           0  Dwight Schrute     Dwight   Schrute
5           0     Jim Halpert        Jim   Halpert
7           0      Pam Beesly        Pam    Beesly
9           0     Ryan Howard       Ryan    Howard

In [57]:
left_merged.to_csv('charactersepisode.csv', index=False)